tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/verticalChannel/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-9;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }
    front
    {
        type            symmetryPlane;
    }
    inletCentral
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.15;
        value           uniform 3.75e-9;
    }
    inletSides
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.16;
        value           uniform 3.75e-9;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 3.75e-9;
    }
    walls
    {
        type            compressible::kqRWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
